app/commands/v1/return/return_book_command.rb

      def perform
        data_check
        order = if order_id.present?
                  Order.find_by(id: order_id)
                else
                  Order.find_by(account_id: @account.id, status: :borrowed, book_id: book_id)
                end
        raise ReturnBookCommandError, 'The book loan order does not exist' if order.blank?

        current_time = Time.now
        amount = compute_amount(Date.parse(order.borrowed_at.to_s), Date.parse(current_time.to_s))

        amount ||= MINIMUM_CHARGE

        order.update!(
          {
            status: ::Order.statuses['returned'],
            actual_return_time: current_time,
            amount: amount
          }
        )
        @book.update(inventory: @book.inventory + 1)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`account_id` = 172 AND `orders`.`status` = 0 AND `orders`.`book_id` = 43 LIMIT 1
UPDATE `hot_books` SET `hot_books`.`inventory` = 75, `hot_books`.`updated_at` = '2023-07-08 15:09:11.689019' WHERE `hot_books`.`id` = 1
UPDATE `orders` SET `orders`.`estimated_return_time` = '2023-07-08 15:04:07', `orders`.`amount` = 8583.0, `orders`.`updated_at` = '2023-07-08 15:04:07.583121' WHERE `orders`.`id` = 47
UPDATE `hot_books` SET `hot_books`.`inventory` = 71, `hot_books`.`updated_at` = '2023-07-08 15:04:07.600253' WHERE `hot_books`.`id` = 1


        account_balance = @account.balance - amount
        @account.balance = account_balance.positive? ? account_balance : Account::MINIMUM_BALANCE
        @account.save
---
UPDATE `accounts` SET `accounts`.`balance` = 0.0, `accounts`.`updated_at` = '2023-07-08 15:04:36.977642' WHERE `accounts`.`id` = 1