app/commands/application_command.rb

  def data_check
    if user_id.present?
      @user = ::User.find_by_id user_id
      raise ApplicationCommandError, 'User does not exist' if @user.blank?

      @account = @user.account
      raise ApplicationCommandError, 'Account does not exist' if @account.blank?
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 1 LIMIT 1

  def find_book
    redis_book_value = get_redis_value
    redis_value_blank = redis_book_value.blank?
    target_class = if redis_value_blank || !redis_book_value[:is_hot_book]
                     ::Book
                   else
                     ::HotBook
                   end
    @book = target_class.find_by_id book_id
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1