app/commands/v1/user/manage/set_user_amount_command.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
UPDATE `accounts` SET `accounts`.`balance` = 100.0, `accounts`.`updated_at` = '2023-07-02 11:29:21.311914' WHERE `accounts`.`id` = 1
---
        def perform
          user = ::User.find_by_id user_id
          user.account.update(balance: balance)