app/commands/v1/user/info/search_command.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 1 LIMIT 1
---
        def perform
          user = ::User.find_by_id user_id
          { user_info: user, account_info: user&.account, order_info: user&.account&.orders }