app/commands/v1/borrow/borrow_book_command.rb

      def create_related_data
        current_time = Time.now
        borrowed_at ||= current_time
        ActiveRecord::Base.transaction do
          # create order
          if borrowed_at.present? && estimated_return_time.present?
            amount = compute_amount(Date.parse(borrowed_at.to_s), Date.parse(estimated_return_time.to_s))
          end
          amount ||= DEFAULT_AMOUNT
          order = Order.create({
                                 account_id: @account.id,
                                 book_id: book_id,
                                 status: ::Order.statuses['borrowed'],
                                 borrowed_at: borrowed_at,
                                 estimated_return_time: estimated_return_time,
                                 amount: amount
                               })
          # create or update daily profit data
          daily_profit = DailyProfit.find_or_initialize_by({
                                                             year: current_time.year, month: current_time.month,
                                                             day: current_time.day, book_id: @book.id
                                                           })
          daily_profit.update(amount: daily_profit.amount + amount)
          # calculate monthly data
          monthly_summary = MonthlySummary.find_or_initialize_by(
            user_id: @user.id,
            month: current_time.month,
            year: current_time.year
          )
          amount_spent = monthly_summary.amount_spent || 0
          number_of_borrow = monthly_summary.number_of_borrow || 0
          monthly_summary.update({
                                   amount_spent: amount_spent + amount,
                                   number_of_borrow: number_of_borrow + 1
                                 })
          # inventory deduction
          @book.update(inventory: @book.inventory - 1)
---
INSERT INTO `orders` (`account_id`, `status`, `book_id`, `borrowed_at`, `amount`, `created_at`, `updated_at`) VALUES (172, 0, 43, '2023-07-09 10:56:11', 1.0, '2023-07-09 10:56:11.839152', '2023-07-09 10:56:11.839152')
SELECT `daily_profits`.* FROM `daily_profits` WHERE `daily_profits`.`year` = 2023 AND `daily_profits`.`month` = 7 AND `daily_profits`.`day` = 9 AND `daily_profits`.`book_id` = 43 LIMIT 1
UPDATE `daily_profits` SET `daily_profits`.`amount` = 1.0, `daily_profits`.`updated_at` = '2023-07-08 13:24:06.125402' WHERE `daily_profits`.`id` = 4
SELECT `monthly_summaries`.* FROM `monthly_summaries` WHERE `monthly_summaries`.`user_id` = 1 AND `monthly_summaries`.`month` = 7 AND `monthly_summaries`.`year` = 2023 LIMIT 1
UPDATE `monthly_summaries` SET `monthly_summaries`.`amount_spent` = 2.0, `monthly_summaries`.`number_of_borrow` = 2, `monthly_summaries`.`updated_at` = '2023-07-09 17:53:43.473467' WHERE `monthly_summaries`.`id` = 34
UPDATE `books` SET `books`.`inventory` = 9, `books`.`updated_at` = '2023-07-09 10:56:11.882483' WHERE `books`.`id` = 43

      def deal_hot_book_data
        # get redis values
        redis_book_value = get_redis_value
        redis_book_value[:borrowed_times] += 1
        if redis_book_value[:borrowed_times] >= HOT_LIMIT && !redis_book_value[:is_hot_book] && !redis_book_value[:is_create_hot_book]
          redis_book_value[:is_hot_book] = true
          redis_book_value[:is_create_hot_book] = true
          ::HotBook.create(@book.attributes)
---
INSERT INTO `hot_books` (`id`, `name`, `author`, `inventory`, `created_at`, `updated_at`) VALUES (2, 'Star Trek', 'Eugene Wesley Roddenberry', -2, '2023-07-08 11:43:45.080350', '2023-07-08 12:32:39.318853')