app/commands/v1/book/search_command.rb

      def deal_query_time(start_time = nil, end_time = nil)
        order = Order.where(book_id: @book.id).select('id').limit(1).exists?
        return [DailyProfit.none, Order.none] if order.blank?

        daily_profits = @book.daily_profits
        orders = Order.none

        start_time_end_of_the_day = start_time.present? ? start_time.to_time.end_of_day : nil
        end_time_of_the_day = end_time.present? ? end_time.to_time.beginning_of_day : nil
        # The unilateral time is null
        if start_time.present? && end_time.blank?
          orders = @book.orders.where('created_at between ? and ?', start_time.to_time, start_time_end_of_the_day)
          daily_profits = daily_profits.where('created_at >= ?', start_time_end_of_the_day)
        elsif end_time.present? && start_time.blank?
          orders = @book.orders.where('created_at between ? and ?', end_time_of_the_day, end_time.to_time)
          daily_profits = daily_profits.where('created_at <= ?', end_time_of_the_day)
        elsif start_time.present? && end_time.present?
          # Determine whether the two times are on the same day or adjacent days
          daily_profits = if start_time.to_date == end_time.to_date || (start_time.to_date - end_time.to_date).abs == 1
                            # binding.pry
                            DailyProfit.none
                          else
                            daily_profits.where('created_at between ? and ?', start_time_end_of_the_day, end_time_of_the_day)
                          end
          start_orders = @book.orders.where('created_at between ? and ?', end_time_of_the_day, end_time.to_time)
          end_orders = @book.orders.where('created_at between ? and ?', start_time.to_time, start_time_end_of_the_day)
---
SELECT `orders`.`id` FROM `orders` WHERE `orders`.`book_id` = 1
SELECT 1 AS one FROM `orders` WHERE `orders`.`book_id` = 42 LIMIT 1
SELECT 1 AS one FROM `orders` WHERE `orders`.`book_id` = 1 LIMIT 1
SELECT `daily_profits`.* FROM `daily_profits` WHERE `daily_profits`.`book_id` = 1